Repository: Fuan200/sslcheck
Catalog: src/*.po
Languages: fr, it

source: sslcheck <domain> prints domain and remainder of days until cert expires
fr: sslcheck <domaine> affiche le domaine et le nombre de jours restants avant l'expiration du certificat
it: sslcheck <dominio> mostra il dominio e i giorni rimanenti fino alla scadenza del certificato

source: -s --short <domain> prints only the days
fr: -s --short <domaine> affiche uniquement le nombre de jours
it: -s --short <dominio> mostra solo i giorni

source: -j --json <domain> prints output as JSON
fr: -j --json <domaine> affiche la sortie au format JSON
it: -j --json <dominio> mostra l'output in formato JSON

source: -p --port <port> use custom port instead of 443
fr: -p --port <port> utilise un port personnalisé à la place de 443
it: -p --port <porta> usa una porta personalizzata invece di 443

source: -h --help prints this menu
fr: -h --help affiche ce menu
it: -h --help mostra questo menu

source: -v --version prints version
fr: -v --version affiche la version
it: -v --version mostra la versione

source: Error creating SSL context
fr: Erreur lors de la création du contexte SSL
it: Errore nella creazione del contesto SSL

source: Error getting SSL object
fr: Erreur lors de l'obtention de l'objet SSL
it: Errore nell'ottenimento dell'oggetto SSL

source: Error connecting to %s
fr: Erreur de connexion à %s
it: Errore di connessione a %s

source: No certificate found for %s
fr: Aucun certificat trouvé pour %s
it: Nessun certificato trovato per %s

source: Could not calculate certificate expiration
fr: Impossible de calculer l'expiration du certificat
it: Impossibile calcolare la scadenza del certificato

source: Expired %d days ago
fr: Expiré il y a %d jours
it: Scaduto %d giorni fa

source: Domain: %s | Certificate EXPIRED %d days ago
fr: Domaine : %s | Certificat expiré il y a %d jours
it: Dominio: %s | Certificato SCADUTO %d giorni fa

source: Domain: %s | Days until Certification expires: %d
fr: Domaine: %s | Jours restants avant expiration du certificat: %d
it: Dominio: %s | Giorni fino alla scadenza del certificato: %d
